模板(tempaltes)



insert into myapp_students(sname,sgender,scontend,isDelete,sgrade_id,sage)values("张三",0,"习近平在黑龙江考察 首站来到建三江",0,6,52),
                  ("李四",1,"习近平在黑龙江考察 首站来到建三江",0,6,25),
                  ("王五",0,"习近平在黑龙江考察 首站来到建三江",0,8,31),
                  ("吕涛",1,"习近平在黑龙江考察 首站来到建三江",0,5,30),
                  ("刘杰",0,"习近平在黑龙江考察 首站来到建三江",0,6,29),
                  ("张丽英",1,"习近平在黑龙江考察 首站来到建三江",0,4,28),
                  ("习大大",1,"习近平在黑龙江考察 首站来到建三江",0,2,27),
                  ("王岐山",1,"习近平在黑龙江考察 首站来到建三江",0,6,26),
                  ("黄勇",0,"习近平在黑龙江考察 首站来到建三江",0,6,25);



1   定义模板   ------变量 ----------视图传递给模板的数据






















